[
    {
        "raw": "Natural User Interfaces, Child-Computer Interaction, Human-Computer Interaction, Gesture Recognition, Speech Recognition, Whole-Body Interaction, Pattern Recognition.", 
        "email": "mailto:lanthony@cise.ufl.edu", 
        "name": "\n          Lisa Anthony, Ph.D.         ", 
        "site": "https://www.cise.ufl.edu/people/faculty/lanthony"
    }, 
    {
        "raw": "Computational Neuroscience, Machine Learning, Computer Vision, Operational Research", 
        "email": "mailto:arunava@cise.ufl.edu", 
        "name": "\n          Arunava Banerjee, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/arunava"
    }, 
    {
        "raw": "Programming Languages, Compilers, Software Engineering, Academic Cooperation with Latin America", 
        "email": "mailto:manuel@cise.ufl.edu", 
        "name": "\n          Manuel E. Bermudez, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/manuel"
    }, 
    {
        "raw": "Dr. Boyer's research focuses on how natural language dialogue and intelligent systems can support human learning across educational contexts including within and outside the classroom. Her research group builds computational models of the processes and phenomena during dialogue and learning, and these models drive the adaptivity of intelligent systems. The computational models in turn shed light on effective strategies for supporting human learning. Her group develops systems that support individual and collaborative learning, including tutorial dialogue systems, intelligent tutoring systems, and game-based learning environments. She is part of UF's interdisciplinary Online Learning Institute. ", 
        "email": "mailto:keboyer@ufl.edu", 
        "name": "\n          Kristy Elizabeth Boyer        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/keboyer"
    }, 
    {
        "raw": "Research Interests:", 
        "email": "mailto:butler@cise.ufl.edu", 
        "name": "\n          Kevin R. B. Butler        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/kbutler"
    }, 
    {
        "raw": "Big Network Data, Cyber-security, RFID Systems, Cloud Computing, Cyber-physical Transportation Systems", 
        "email": "mailto:sgchen@cise.ufl.edu", 
        "name": "\n          Shigang Chen, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/sgchen"
    }, 
    {
        "raw": "Computational Biology, digital library systems.", 
        "email": "mailto:suchen@cise.ufl.edu", 
        "name": "\n          Su-Shing Chen, Ph.D.         ", 
        "site": "https://www.cise.ufl.edu/people/faculty/suchen"
    }, 
    {
        "raw": "Distributed Systems", 
        "email": "mailto:chow@cise.ufl.edu", 
        "name": "\n          Randy Chow, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/chow"
    }, 
    {
        "email": "mailto:christinaboucher@ufl.edu", 
        "name": "\n          Christina Boucher, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/cboucher"
    }, 
    {
        "raw": "Human-Centered Computing, Affective Computing, Engaging youth in STEM through the arts, Utlizing technology to cultivate empathy, Supporting diverse teams in working together", 
        "email": "mailto:shanib@cise.ufl.edu", 
        "name": "\n          Shaundra B. Daily, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/daily"
    }, 
    {
        "raw": "Expert Systems, Artificial Intelligence, Medical Applications of Artificial Intelligence, Computer Science Education, Information Retrieval, Web-based Applications, Natural Language Understanding, Requirements Capturing, Programming Environments", 
        "email": "mailto:ddd@cise.ufl.edu", 
        "name": "\n          Douglas D. Dankel II, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/ddd"
    }, 
    {
        "email": "mailto:adobra@cise.ufl.edu", 
        "name": "\n          Alin Dobra        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/adobra"
    }, 
    {
        "raw": "Mathematical Signal Processing, Sampling Theory, Compressed Sensing, Computational Imaging, Biomedical Imaging, Graphics and Visualization", 
        "email": "mailto:entezari@cise.ufl.edu", 
        "name": "\n          Alireza Entezari, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/entezari"
    }, 
    {
        "email": "mailto:fortes@ufl.edu", 
        "name": "\n          Jose A.B. Fortes, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/fortes"
    }, 
    {
        "raw": "Paul Gader received his Ph.D. in Mathematics for parallel image processing and applied mathematics research in 1986 from the University of Florida. He has worked as a Senior Research Scientist at Honeywell’s Systems and Research Center, as a Research Engineer and Manager at the Environmental Research Institute of Michigan (ERIM), and as a faculty member at the University of Wisconsin - Oshkosh, and the University of Missouri - Columbia. He joined the faculty of the University of Florida in August 2001. He performed his first research in image processing in 1984 when he worked on algorithms for detection of bridges in Forward Looking Infra-Red (FLIR) imagery. At ERIM and later at the University of Missouri, he led teams involved in the research and development of real-time, handwritten address recognition systems for the U.S. Postal Service. He developed, implemented, and tested image processing, neural network, and fuzzy set based algorithms for handwritten digit recognition and segmentation, numeric field recognition, word recognition and segmentation, and line segmentation. He has also worked on a number of other image and signal analysis projects, including medical imaging, vehicle detection and recognition, acoustic signature analysis, and bio-medical pattern recognition as well as performing fundamental research in image algebra, fuzzy set theory, and and Choquet integral based mathematical morphology. He has actively researched and developed algorithms for land mine research since 1996. He has led teams that devised and field tested several real-time algorithms for mine detection. He served as Technical Director of the University of Missouri MURI on Humanitarian Demining. Past and present landmine detection projects involve algorithm development for data generated from hand-held, ground vehicle-based, and airborne sensors, including ground penetrating radar, acoustic/seismic, IR (emissive and reflective bands), long-wave, short-wave, near IR, and visible hyperspectral imagery, and wide-band electro-magnetic sensors. He has investigated a wide variety of algorithmic approaches in the context of solving real-world problems. In the last few years, his interests have expanded into the domains of hyperspectral image analysis. Dr. Gader is a senior member of the IEEE and has over 245 technical publications in the areas of image and signal processing, applied mathematics, and pattern recognition, including over 74 refereed journal articles.", 
        "email": "mailto:pgader@cise.ufl.edu", 
        "name": "\n          Paul D. Gader, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/pgader"
    }, 
    {
        "raw": "Research Interests: Computer Science Education, Design of Learning Technologies & Learning Environments, K-12 Computing After-school & summer Camps, Learning Sciences", 
        "email": "mailto:gmccune@ufl.edu", 
        "name": "\n          Christina Gardner-McCune, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/gmccune"
    }, 
    {
        "raw": "Research Interests:", 
        "email": "mailto:juan@ufl.edu", 
        "name": "\n          Juan E. Gilbert, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/jgilbert"
    }, 
    {
        "raw": "Mobile and Pervasive Computing Fundamentals.", 
        "email": "mailto:helal@cise.ufl.edu", 
        "name": "\n          Abdelsalam (Sumi) Helal, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/helal"
    }, 
    {
        "raw": "Wireless Networks Design, Mobility Modeling, Network Simulation, Protocol Architecture & Design, Sensor Networks, Mobile Social Networks, Mobile Networks Measurement", 
        "email": "mailto:helmy@cise.ufl.edu", 
        "name": "\n          Ahmed Helmy, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/helmy"
    }, 
    {
        "raw": "I am interested in human-centered computer graphics. In my lab, we ask questions such as \"how do comic artists create a comic book?\" and \"how do film editors edit a movie?\". Asking such questions leads to research at the intersection of computer graphics, applied perception, and data-driven algorithms.", 
        "email": "mailto:ejain@cise.ufl.edu", 
        "name": "\n          Eakta Jain, Ph. D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/ejain"
    }, 
    {
        "raw": "Indexing, storing, retrieval, summarization, and mining of biological databases.", 
        "email": "mailto:tamer@cise.ufl.edu", 
        "name": "\n          Tamer Kahveci, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/tamer"
    }, 
    {
        "raw": "Multimedia Communication, High-Speed Wired and Wireless Networks, Storage Systems and Artificial Intelligence", 
        "email": "mailto:jcliu@cise.ufl.edu", 
        "name": "\n          Jonathan (Chien-Liang) Liu, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/jcliu"
    }, 
    {
        "raw": "Virtual Environments (virtual humans, interaction, rendering, avatars, and real-world applications)Human-Computer Interaction (interacting with digital characters, virtual worlds, 3D interfaces)", 
        "email": "mailto:lok@cise.ufl.edu", 
        "name": "\n          Benjamin C. Lok, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/lok"
    }, 
    {
        "raw": "Utilizing signal processing to render 3D audio Using 3D  audio to sonify information and environmentsDiscovering interface design techniques for developing virtual auditory environmentsUsing 3D audio to augment assistive technology for persons with visual impairmentsEnhancing immersion and realness in virtual worlds using 3D audio", 
        "email": "/people/faculty/prabhat", 
        "name": "\n          Kyla McMullen, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/kyla"
    }, 
    {
        "raw": "Design Automation of Embedded Systems, Energy-aware Computing, Reconfigurable Architectures, Hardware Security and Trust, System Validation and Verification, and Post-Silicon Debug", 
        "email": "mailto:prabhat@ufl.edu", 
        "name": "\n          Prabhat Mishra, Ph.D.         ", 
        "site": "https://www.cise.ufl.edu/people/faculty/prabhat"
    }, 
    {
        "raw": "Networks (layers 2 and up): modeling, simulation, congestion control, multipath routing, error control, powerline communications. Distributed systems: overlay networks, fault tolerant services, P2P systems, distributed file systems. Computer and network security: Access control models, multilevel secure systems, policy modeling, cryptographic protocols, steganography, stegananalysis, traffic analysis, anonymity, trust models. Distributed collaboration and CSCW: inter-organizational collaboration, infrastructure for CSCW over WANs, group management models.", 
        "email": "mailto:nemo@cise.ufl.edu", 
        "name": "\n          Richard Newman, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/nemo"
    }, 
    {
        "raw": "Computer system architectures and microarchitectures, Parallel and high-performance computing, Performance evaluations", 
        "email": "mailto: peir@cise.ufl.edu", 
        "name": "\n          Jih-Kwon Peir, Ph.D.         ", 
        "site": "https://www.cise.ufl.edu/people/faculty/peir"
    }, 
    {
        "raw": "Modeling and computing with geometry: computer graphics, geometric design, numerical computations", 
        "email": "mailto:jorg@cise.ufl.edu", 
        "name": "\n          Jorg Peters, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/jorg"
    }, 
    {
        "raw": "Machine Learning, Computer Vision and Medical Image Analysis", 
        "email": "mailto:anand@cise.ufl.edu", 
        "name": "\n          Anand Rangarajan, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/anand"
    }, 
    {
        "raw": "Sanjay Ranka is a Professor in the Department of Computer Science. His current research interests are data mining, informatics and grid computing for data intensive applications in High Energy Physics, BioTerrorism and BioMedical Computing. Most recently he was the Chief Technology Officer at Paramark where he developed real-time optimization software for optimizing marketing campaigns. Sanjay has also held positions as a tenured faculty positions at Syracuse University and as a researcher/visitor at IBM T.J. Watson Research Labs and Hitachi America Limited. Sanjay earned his Ph.D. (Computer Science) from the University of Minnesota in 1988 and a B. Tech. in Computer Science from IIT, Kanpur, India in 1985. He has coauthored two books: Elements of Neural Networks (MIT Press) and Hypercube Algorithms (Springer Verlag), 50+ journal articles and 80+ refereed conference articles. He serves on the editorial board of the Journal of Parallel and Distributed Computing and was a past member of the Parallel Compiler Runtime Consortium and the Message Passing Initiative Standards Committee. He was one of the main architects of the Syracuse Fortran 90D/HPF compiler. He is a fellow of the IEEE and AAAS, advisory board member of IEEE Technical Committee on Parallel Processing and a member of IFIP Committee on System Modeling and Optimization.", 
        "email": "mailto:ranka@cise.ufl.edu", 
        "name": "\n          Sanjay Ranka, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/ranka"
    }, 
    {
        "raw": "Much of my research had been devoted to autonomous target recognition. A direct result of this research was the development of the theory of image algebra, the theory of lattice based neural networks, and the notion of the generalized matrix product and its applications. My current research efforts cover such diverse areas as hyperspectral image segmentation, computer vision and signal processing, pattern recognition, biomimetic artificial neural networks, and brain research.", 
        "email": "mailto:ritter@cise.ufl.edu", 
        "name": "\n          Gerhard X Ritter, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/ritter"
    }, 
    {
        "raw": "Natural User Interfaces, Human-Computer Interaction, Gesture Recognition, Whole-Body Interaction, Computer-Supported Cooperative Work, and Usable Bioinformatics.", 
        "email": "mailto:jaime.ruiz@ufl.edu", 
        "name": "\n          Jaime Ruiz, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/jaime"
    }, 
    {
        "raw": "Algorithms and data structures, parallel algorithms, high-performance computing, medical algorithms, network algorithms.", 
        "email": "mailto:sahni@cise.ufl.edu", 
        "name": "\n          Sartaj Sahni, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/sahni"
    }, 
    {
        "raw": "Software engineering and programming languages for concurrent and high performance parallel computing.", 
        "email": "mailto:sanders@cise.ufl.edu", 
        "name": "\n          Beverly Sanders, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/sanders"
    }, 
    {
        "raw": "Computer vision, Data/Image compression, Parallel and embedded computing, Error analysis, Artificial Intelligence", 
        "email": "mailto:mssz@cise.ufl.edu", 
        "name": "\n          Mark S. Schmalz, Ph.D., O.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/mssz"
    }, 
    {
        "raw": "Database systems, spatial databases, spatiotemporal databases, moving object databases, fuzzy databases, Geographic Information Systems (GIS), Computational Geometry, geoinformatics, spatial and spatiotemporal data handling", 
        "email": "mailto:mschneid@cise.ufl.edu", 
        "name": "\n          Markus Schneider, PhD        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/mschneid"
    }, 
    {
        "raw": "Theory and practice of modern cryptographyDesign and analysis of real-world cryptographic primitivesCryptography for non-traditional settingsCensorship circumvention toolsSecurity aspects of machine learning", 
        "email": "mailto:teshrim@cise.ufl.edu", 
        "name": "\n          Tom Shrimpton, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/shrimpton"
    }, 
    {
        "raw": "(1) Geometry", 
        "email": "mailto:sitharam@cise.ufl.edu", 
        "name": "\n          Meera Sitharam, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/sitharam"
    }, 
    {
        "raw": "I teach. I am interested in: object-oriented programming & design patterns, game design & implementation, digital media programming, and intelligent systems.", 
        "email": "mailto:dts@cise.ufl.edu", 
        "name": "\n          David Small        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/dts"
    }, 
    {
        "raw": "Database and knowledge base management, distributed and parallel computing, collaborative systems, Web services, e-business, e-government and e-learning.", 
        "email": "mailto:su@cise.ufl.edu", 
        "name": "\n          Stanley Y. W. Su, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/su"
    }, 
    {
        "raw": "Algorithms, Optimization, Smart Grids, Social Networks, Networking Infrastructures, Cyber Security", 
        "email": "mailto:mythai@cise.ufl.edu", 
        "name": "\n          My T. Thai, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/mythai"
    }, 
    {
        "raw": "Requirements Engineering (process, methods, elicitation, analysis, specification) Software Testing and Verification (process, test design methods, quality assurance, V&V for safety critical software) Software Engineering Education and Technology Transfer (short course development, distance learning, just-in-time training, graduate programs for working software professionals) Software Development Process and Protocols, Contracts, Intellectual Property Issues", 
        "email": "mailto:smt@cise.ufl.edu", 
        "name": "\n          Stephen M. Thebaut, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/smt"
    }, 
    {
        "raw": "Bio", 
        "email": "mailto:ctoler@cise.ufl.edu", 
        "name": "\n          Corey Toler-Franklin, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/ctoler-franklin"
    }, 
    {
        "raw": "Cellular and Mobile SecurityInternet SecuritySystems SecurityApplied CryptographyNational Policy", 
        "email": "mailto:traynor@cise.ufl.edu", 
        "name": "\n          Patrick Traynor        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/ptraynor"
    }, 
    {
        "raw": "Alper Üngör's research is on the junction of the two main branches of computer science, theoretical computer science and scientific computing. Specifically, his research interests are in computational geometry, with special emphasis in mesh generation. His main goal is to understand the mathematical (mostly geometrical) structure of engineering problems and develop provably good algorithms to solve them. There are many application domains - computer graphics, computer aided design, computer vision, robotics, scientific computing, computational biology and geographic information systems and others- in which geometric algorithms play a fundamental role. During his Ph.D. studies at the University of Illinois, he has mainly focused on the geometric problems arising in finite element mesh generation. During his postdoctoral studies at Duke University he was involved in the BioGeometry project, an interdisciplinary effort to address fundamental computational problems in the representation of molecular structures and the simulation of biochemical processes important to life.", 
        "email": "mailto:ungor@cise.ufl.edu", 
        "name": "\n          Alper Ungor, Ph. D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/ungor"
    }, 
    {
        "raw": "My research interests span: Statistics on Manifolds, Medical Image Computing, Image Processing and Computer Vision, Computer Graphics, Statistical Learning, Information Geometry and Applied Mathematics. Most of my research these days is concerned with efficient recursive computation of statistics on Riemannian manifolds with applications to atlas (reference template) construction, clustering, data retrieval in Medical Imaging and Computer VIsion and Machine Learning. Further, I have also been developing dynamical systems on matrix manifolds e.g., manifold of symmetric positive definite matrices for real time tracking applications in Computer Vision. Another interesting problem I have performed extensive research on is mapping out the neuronal fiber tracks from diffusion MR scans of human and vertebrate brains. I have been involved in developing algorithms and software for the past 15+ years in the field of diffusion MRI analysis with applications to neurodegenerative disorders such as, Epilepsy, Parkinsons, Alzheimers diseases. In Computer Vision, me and my collaborators have developed state-of-the-art face recognition and face relighting algorithms. My ealier work (in the 90's) was focused on level-set segmentation methods and me and my collaborators (Ravi Malladi and James Sethian) introduced the geometric active contours in a level-set framework to the field of Computer VIsion (SPIE'93, ECCV'94, PAMI'95). Me and my students developed fast preconditioned Conjugate Gradient Algorithms for a suite of problems in Computer Vision e.g. surface reconstruction with discontinuities from sparse range data sets, shape from shading, optical flow etc. For more details, I invite you to visit my home page.", 
        "email": "mailto:vemuri@cise.ufl.edu", 
        "name": "\n          Baba C. Vemuri, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/vemuri"
    }, 
    {
        "raw": "My research interest is to build systems and design algorithms to support large-scale and advanced data analysis (e.g., using statistics and machine learning), which goes beyond simple aggregations and OLAP in traditional databases and data warehouses.", 
        "email": "mailto:daisyw@cise.ufl.edu", 
        "name": "\n          Daisy Zhe Wang, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/daisyw"
    }, 
    {
        "email": "mailto:jnw@cise.ufl.edu", 
        "name": "\n          Joseph N Wilson, Ph.D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/jnw"
    }, 
    {
        "raw": "My research interests are in the computer networking area, including performance evaluation of network protocols and algorithms, routing and flow control, wireless network link scheduling, resource allocation in networks and datacenters, energy saving in wireless sensor networks, and content distribution algorithms on overlay networks. I am also interested in probability theory, stochastic processes, and queueing theory.", 
        "email": "mailto:yx1@cise.ufl.edu", 
        "name": "\n          Ye Xia        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/yx1"
    }, 
    {
        "email": "mailto:rzhang@cise.ufl.edu", 
        "name": "\n          Rong Zhang, Ph. D.        ", 
        "site": "https://www.cise.ufl.edu/people/faculty/rzhang"
    }
]